OpenNuvoton/NuML_Studio/app/NuML_TFLM_Tool/templates/ML_M55M1_CMSIS_SDS/M55M1BSP-3.01.002/SampleCode/SDS/SDS_Recorder_gsensor_uart_CMSIS/main.c
/*----------------------------------------------------------------------------
 * Name:    main.c
 *----------------------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include "NuMicro.h"
#include "USART_PinConfig.h"            // PinConfig for USART driver

#include "sds_app_config.h"
#include "driver_mpu6500_fifo.h"

#include <math.h>

uint8_t button_start = 0;

// Read sensor thread
static __NO_RETURN void read_sensors(void *argument)
{
    uint32_t num, buf_size, max_num;
    uint32_t timestamp;
    (void)   argument;

    timestamp = osKernelGetTickCount();

    for (;;)
    {
        if (close_flag == 0U)
        {
            //printf("sensorGetStatus %u\r\n", sensorGetStatus(sensorId_accelerometer).active);
            if (sensorGetStatus(sensorId_accelerometer).active != 0U)
            {
                max_num = SENSOR_ACCELEROMETER_SIZE / SENSOR_ACCELEROMETER_NUM_PER_SAMPLE;
                num = sensorReadSamples(sensorId_accelerometer, max_num, sensorBuf, SENSOR_HARDWARE_BUF_SIZE);

                if (num != 0U)
                {
                    buf_size = num * SENSOR_ACCELEROMETER_NUM_PER_SAMPLE * sizeof(sensorBuf[0]);
                    num = sdsRecWrite(recId_accelerometer, timestamp, sensorBuf, buf_size);
                    //printf("sdsRecWrite Done: num: %u, buf_size: %u, timestamp: %u\r\n", num, buf_size, timestamp);

                    if (num != buf_size)
                    {
                        printf("%s: Recorder write failed\r\n", sensorConfig_accelerometer->name);
                    }
                }
            }

            // If you have second sensor
            //if (sensorGetStatus(sensorId_temperatureSensor).active != 0U) {
            //  num = sizeof(sensorBuf) / sensorConfig_temperatureSensor->sample_size;
            //  num = sensorReadSamples(sensorId_temperatureSensor, num, sensorBuf, sizeof(sensorBuf));
            //  if (num != 0U) {
            //    buf_size = num * sensorConfig_temperatureSensor->sample_size;
            //    num = sdsRecWrite(recId_temperatureSensor, timestamp, sensorBuf, buf_size);
            //    if (num != buf_size) {
            //      printf("%s: Recorder write failed\r\n", sensorConfig_temperatureSensor->name);
            //    }
            //  }
            //}

        }
        else
        {
            if (event_close_sent == 0U)
            {
                event_close_sent = 1U;
                osThreadFlagsSet(thrId_demo, EVENT_CLOSE);
            }
        }

        timestamp += SENSOR_POLLING_INTERVAL;
        osDelayUntil(timestamp);
    }
}

// Recorder event callback
static void recorder_event_callback(sdsRecId_t id, uint32_t event)
{
    if (event & SDS_REC_EVENT_IO_ERROR)
    {
        if (id == recId_accelerometer)
        {
            printf("%s: Recorder event - I/O error\r\n", sensorConfig_accelerometer->name);
        }

        //if (id == recId_temperatureSensor) {
        //  printf("%s: Recorder event - I/O error\r\n", sensorConfig_temperatureSensor->name);
        //}
    }
}

// Recorder start
static void recorder_start(void)
{

    // Accelerometer
    // Open Recorder
    recId_accelerometer = sdsRecOpen("Accelerometer",
                                     recBuf_accelerometer,
                                     sizeof(recBuf_accelerometer),
                                     SDS_REC_IO_THRESHOLD_ACCELEROMETER);
    sensorEnable(sensorId_accelerometer);
    printf("Accelerometer enabled\r\n");

    // Temperature sensor
    // Open Recorder
    //recId_temperatureSensor = sdsRecOpen("Temperature",
    //                                      recBuf_temperatureSensor,
    //                                      sizeof(recBuf_temperatureSensor),
    //                                      REC_IO_THRESHOLD_TEMPERATURE_SENSOR);
    //sensorEnable(sensorId_temperatureSensor);
    //printf("Temperature sensor enabled\r\n");
}

// Recorder stop
static void recorder_stop(void)
{
    uint32_t flags;

    event_close_sent = 0U;
    close_flag = 1U;
    flags = osThreadFlagsWait(EVENT_CLOSE, osFlagsWaitAny, osWaitForever);

    if ((flags & osFlagsError) == 0U)
    {

        // Accelerometer disable
        sensorDisable(sensorId_accelerometer);
        // Close Recorder
        sdsRecClose(recId_accelerometer);
        recId_accelerometer = NULL;
        printf("Accelerometer disabled\r\n");

        // Temperature sensor disable
        //sensorDisable(sensorId_temperatureSensor);
        //// Close Recorder
        //sdsRecClose(recId_temperatureSensor);
        //recId_temperatureSensor = NULL;
        //printf("Temperature sensor disabled\r\n");
    }

    close_flag = 0U;
}

NVT_ITCM void GPH_IRQHandler(void)
{
    volatile uint32_t temp;

    /* To check if PH.1 interrupt occurred */
    if (GPIO_GET_INT_FLAG(PH, BIT1))
    {
        GPIO_CLR_INT_FLAG(PH, BIT1);
        button_start = 1;
    }
    else
    {
        /* Un-expected interrupt. Just clear all PB interrupts */
        temp = PH->INTSRC;
        PH->INTSRC = temp;
        printf("PH_1 Un-expected interrupts.\n");
    }
}

void SetSdsIOUartCLK(void)
{
#if (!defined(DEBUG_ENABLE_SEMIHOST) || (DEBUG_ENABLE_SEMIHOST == 1)) && !defined(OS_USE_SEMIHOSTING)
#if (RTE_USART0)
    /* Select UART0 clock source from HIRC */
	  CLK_SetModuleClock(UART0_MODULE, CLK_UARTSEL0_UART0SEL_HIRC, CLK_UARTDIV0_UART0DIV(1));
	  /* Enable module peripheral clock */
    CLK_EnableModuleClock(UART0_MODULE);
	
	  //SYS_ResetModule(SYS_UART0RST);
#endif
#if (RTE_USART6)
    /* Select UART0 clock source from HIRC */
	  CLK_SetModuleClock(UART6_MODULE, CLK_UARTSEL0_UART6SEL_HIRC, CLK_UARTDIV0_UART6DIV(1));
	  /* Enable module peripheral clock */
    CLK_EnableModuleClock(UART6_MODULE);
	
	  //SYS_ResetModule(SYS_UART6RST);
#endif
#endif
}

__WEAK void SetSdsIOUartMFP(void)
{
#if (RTE_USART0)
		RTE_SET_USART0_TX_PIN();
    RTE_SET_USART0_RX_PIN();
#endif
#if (RTE_USART6)		
		RTE_SET_USART6_TX_PIN();
    RTE_SET_USART6_RX_PIN();
    //RTE_SET_USART6_CTS_PIN();
    //RTE_SET_USART6_RTS_PIN();
#endif

}

static void SYS_Init(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Enable PLL0 220MHz clock from HIRC and switch SCLK clock source to PLL0 */
    CLK_SetBusClock(CLK_SCLKSEL_SCLKSEL_APLL0, CLK_APLLCTL_APLLSRC_HIRC, FREQ_220MHZ);

    /* Update System Core Clock */
    /* User can use SystemCoreClockUpdate() to calculate SystemCoreClock. */
    SystemCoreClockUpdate();

    /* Enable UART module clock */
    SetDebugUartCLK();

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    SetDebugUartMFP();
	
	  /*CMSIS USART driver */
		SetSdsIOUartCLK();
		SetSdsIOUartMFP();

    /* Enable LPI2C module clock, for G-sensor*/
    CLK_EnableModuleClock(LPI2C0_MODULE);

    SET_LPI2C0_SCL_PC12();

    SET_LPI2C0_SDA_PC11();
    /* Open LPI2C0 module and set bus clock */
    //LPI2C_Open(LPI2C0, 100000);

    /* BTN_1 */
    /* Enable GPIO Port B clock */
    CLK_EnableModuleClock(GPIOH_MODULE);
    /* Enable Internal low speed RC clock */
    CLK_EnableXtalRC(CLK_SRCCTL_LIRCEN_Msk);
    /* Waiting for Internal low speed RC clock ready */
    CLK_WaitClockReady(CLK_STATUS_LIRCSTB_Msk);

    /* Lock protected registers */
    SYS_LockReg();
}

// Sensor Demo
static __NO_RETURN void demo(void *argument)
{

    uint32_t  value;
    uint32_t  value_last = 0U;
    uint8_t   rec_active = 0U;

    (void) argument;

    /* Configure PH.1 as Input mode and enable interrupt by falling edge trigger */
    /* BTN1 */
    GPIO_SetMode(PH, BIT1, GPIO_MODE_INPUT);
    GPIO_EnableInt(PH, 1, GPIO_INT_FALLING);
    /* Enable interrupt de-bounce function and select de-bounce sampling cycle time is 1024 clocks of LIRC clock */
    GPIO_SET_DEBOUNCE_TIME(PH, GPIO_DBCTL_DBCLKSRC_LIRC, GPIO_DBCTL_DBCLKSEL_1024);
    GPIO_ENABLE_DEBOUNCE(PH, BIT1);
    NVIC_EnableIRQ(GPH_IRQn);

    thrId_demo = osThreadGetId();

    // Get sensor identifier
    printf("SENSOR: sensorGetId\n");
    sensorId_accelerometer     = sensorGetId("Accelerometer");
    //sensorId_temperatureSensor = sensorGetId("Temperature");

    // Get sensor configuration
    printf("SENSOR: sensorGetConfig\n");
    sensorConfig_accelerometer     = sensorGetConfig(sensorId_accelerometer);
    //sensorConfig_temperatureSensor = sensorGetConfig(sensorId_temperatureSensor);

    // Initialize recorder
    printf("SDS: sdsORec init\n");
    sdsRecInit(recorder_event_callback);

    // Create sensor thread
    printf("osThreadNew\n");
    osThreadNew(read_sensors, NULL, NULL);

    for (;;)
    {
        // Monitor user button, Button pressed
        if (button_start == 1)
        {
            button_start = 0; //clear button
            NVIC_DisableIRQ(GPH_IRQn);


            if (rec_active == 0U)
            {
                rec_active = 1U;
                recorder_start();
            }
            else
            {
                rec_active = 0U;
                recorder_stop();
            }

            NVIC_EnableIRQ(GPH_IRQn);
        }

        osDelay(100U);
    }


}

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Init Debug UART for printf */
    InitDebugUart();

    /* Init mpu6500 */
    //    mpu6500_address_t addr = MPU6500_ADDRESS_AD0_HIGH;
    //    mpu6500_interface_t interface = MPU6500_INTERFACE_IIC;
    //    uint16_t len_sample;
    //    static int16_t accel_raw_sp[85][3];
    //    static float accel_g_sp[255];
    //    static int16_t gyro_raw_sp[85][3];
    //    static float gyro_dps_sp[255];
    //    len_sample = 100;
    //    if (mpu6500_fifo_init(interface, addr) == 0)
    //    {
    //      //mpu6500_interface_delay_ms(1000);
    //          uint32_t count;
    //      for (count = 0; count < 800; count++)
    //           CLK_SysTickDelay(1000); // 1 ms = 1000 us
    //          //
    //          //if (mpu6500_fifo_read(accel_raw_sp, accel_g_sp, gyro_raw_sp, gyro_dps_sp, &len_sample) != 0U)
    //      //{
    //      //    printf("mpu6500_fifo_init Fail\n!!");
    //      //}
    //      //else
    //      //{
    //          //  //printf("mpu6500_fifo_read, accel_g_sp: %f, accel_g_sp: %f\r\n", accel_g_sp[0], accel_g_sp[1]);
    //      //
    //      //}
    //    }
    //    else
    //    {
    //        printf("mpu6500_fifo_init Fail\n!!");
    //    }

    osKernelInitialize();                // Initialize CMSIS-RTOS2

    osThreadNew(demo, NULL, NULL);       // Create validation main thread

    osKernelStart();                     // Start thread execution

    for (;;) {}

}
